In [90]:
%load_ext sql
%sql sqlite:///lab2.db3

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @lab2.db3'

# Q2: Write SQL statements to create the three tables and insert the data

In [91]:
# CREATE TABLE 1 : SAILORS

In [92]:
%%sql sqlite://
drop table if exists Sailors;
CREATE TABLE Sailors(
    sid VARCHAR(10), 
    sname CHAR(10) NOT NULL, 
    rating int NOT NULL,
    age double NOT NULL
);

Done.
Done.

[]

In [93]:
# CREATE TABLE 2 : RESERVES

In [94]:
%%sql sqlite://
drop table if exists Reserves;
CREATE TABLE Reserves(
    sid VARCHAR(10),
    bid VARCHAR(10), 
    day date NOT NULL
);

Done.
Done.

[]

In [95]:
# CREATE TABLE 3 : BOATS

In [96]:
%%sql sqlite://
drop table if exists Boats;
CREATE TABLE Boats(
    bid VARCHAR(10), 
    name CHAR(10), 
    color CHAR(10)
);

Done.
Done.

[]

In [97]:
# STORE DATA INTO TABLES FOR TESTING

In [98]:
%%sql 
-- data for sailors table --
insert into Sailors values (22, 'dustin', 7, 45.0);
insert into Sailors values (31, 'lubber', 8, 55.5);
insert into Sailors values (58, 'rusty', 10, 35.0);
insert into Sailors values (7, 'lowry', 8, 35.0);
insert into Sailors values (2, 'kawhi', 10, 29.0);
insert into Sailors values (30, 'stephen', 9, 33.3);

-- data for reserves table -- 
insert into Reserves values (22, 110, '10/10/1998');
insert into Reserves values (58, 103, '11/12/1996');
insert into Reserves values (7, 112, '6/21/1991');
insert into Reserves values (30, 115, '3/14/1988');
insert into Reserves values (2, 112, '6/21/1991');
insert into Reserves values (2, 103, '8/24/2000');

-- data for boats table -- 
insert into Boats values (110, 'interlake', 'green');
insert into Boats values (103, 'clippers', 'blue');
insert into Boats values (112, 'raptors', 'red');
insert into Boats values (115, 'warriors', 'blue');

 * sqlite:///lab2.db3
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

# Q3: Find names of sailors who’ve reserved boat #110

In [99]:
# RETURNS DISTINCT SAILOR NAMES

In [100]:
%%sql
SELECT DISTINCT S.sname
FROM Sailors S, Reserves R
WHERE S.sid = R.sid AND R.bid = 110

 * sqlite:///lab2.db3
Done.

[('dustin',)]

In [101]:
# FOR PRACTICE PURPOSES
# NESTED QUERY THAT RETURNS NAMES OF SAILORS WHO RESERVED BOAT #110

In [102]:
%%sql
SELECT DISTINCT S.sname
FROM Sailors S
WHERE S.sid IN ( SELECT R.sid
                 FROM Reserves R
                 WHERE R.bid = 110 )

 * sqlite:///lab2.db3
Done.

[('dustin',)]

# Q4: Find names of sailors who’ve reserved a red boat

In [103]:
# RETURNS DISTINCT SAILOR NAMES

In [104]:
%%sql
SELECT DISTINCT S.sname
FROM Sailors S, Reserves R, Boats B
WHERE S.sid = R.sid AND R.bid = B.bid AND B.color = 'red'

 * sqlite:///lab2.db3
Done.

[('kawhi',), ('lowry',)]

# Q5: Find names of sailors who’ve reserved a red or a blue boat

In [105]:
# RETURNS DISTINCT SAILOR NAMES FOR RED OR BLUE BOATS USING UNION

In [106]:
%%sql
SELECT DISTINCT S.sname
FROM Sailors S, Reserves R, Boats B
WHERE S.sid = R.sid AND R.bid = B.bid AND B.color = 'red'
UNION 
SELECT S2.sname
FROM Sailors S2, Reserves R2, Boats B2
WHERE S2.sid = R2.sid AND R2.bid = B2.bid AND B2.color = 'blue'

 * sqlite:///lab2.db3
Done.

[('kawhi',), ('lowry',), ('rusty',), ('stephen',)]

# Q6: Find names of sailors who’ve reserved a red and a blue boat

In [107]:
# USE NESTED QUERY TO FIND RED AND BLUE FOR BOAT COLORS USING INTERSECT
# THE 'IN' OPERATOR CHECKS IF A CERTAIN VALUE IS IN THE TABLE RETURNED BY THE SUBQUERY

In [108]:
%%sql
SELECT DISTINCT S.sname
FROM Sailors S
WHERE S.sid IN ( SELECT S1.sid 
                 FROM Sailors S1, Reserves R1, Boats B1
                 WHERE S1.sid = R1.sid AND R1.bid = B1.bid AND B1.color = 'red' 
                 INTERSECT
                 SELECT S2.sid
                 FROM Sailors S2, Reserves R2, Boats B2
                 WHERE S2.sid = R2.sid AND R2.bid = B2.bid AND B2.color = 'blue'
               )

 * sqlite:///lab2.db3
Done.

[('kawhi',)]

# Q7: Find names of sailors who’ve reserved only blue boats

In [109]:
# RETURNS DISTINCT SAILOR NAMES
# FINDS SAILORS WHO RESERVED BLUE BOATS 
# THEN FIND THE SAILORS WHO DIDN'T RESERVE OTHER COLORS

In [110]:
%%sql
SELECT S.sname
FROM Sailors S, Reserves R, Boats B
WHERE S.sid = R.sid AND R.bid = B.bid AND B.color = 'blue'
EXCEPT
SELECT DISTINCT S2.sname
FROM Sailors S2, Reserves R2, Boats B2
WHERE R2.sid = S2.sid AND R2.bid = B2.bid AND B2.color <> 'blue'

 * sqlite:///lab2.db3
Done.

[('rusty',), ('stephen',)]

In [111]:
%%sql
SELECT SNAME
FROM Sailors NATURAL JOIN Boats NATURAL JOIN Reserves
WHERE Boats.color = "blue"
EXCEPT
SELECT SNAME
FROM Sailors NATURAL JOIN Boats NATURAL JOIN Reserves
WHERE Boats.color <> "blue";

 * sqlite:///lab2.db3
Done.

[('rusty',), ('stephen',)]